/**********************718创新实验室开发板例程*********************
*  编写：718创新实验室
*  平台：STM32F103ZET6
*  说明：由于作者的水平有限，若有不足之处，还请大家谅解。
*		 建议大家多看看数据手册。
******************************************************************/


/**************************功能说明********************************
* 定时器中断例程：
*	1、定时
*	2、中断服务函数做事
**************************功能说明********************************/

#include "include.h"

int main()
{
	Led_Init(LED_ALL);
	Led_Set(LED_ALL, 1);
	delay_init();
	int led = LED1;
	//计数器从0加到4999,再加一又变为0,一个周期5000次
	//7199为PSC(prescaler)预分频值。TIM_Prescaler可为0到65535的任何值,对应1到65536分频
	//TIM_Init(4999, 7199);			//计数器频率=72M/(7199+1)=10kHz,10KHZ是0.1ms，一个定时器中断的时间=5000*（1/10）=500ms
	while(1)
	{
		for (int i = 0; i < 6;i++)
		{
			Led_Set(led, 0);
			delay_ms(100);
			Led_Set(led++, 1);
		}
		led = LED1;
	}
}


